app/controllers/comments_controller.rb

  def create
    @prototype = Prototype.find(params[:prototype_id])
    @comment = Comment.new(comment_params)
    if @comment.save
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 5 LIMIT 1
INSERT INTO `comments` (`content`, `prototype_id`, `user_id`, `created_at`, `updated_at`) VALUES ('test', 5, 1, '2022-12-30 05:52:12.742051', '2022-12-30 05:52:12.742051')