app/controllers/prototypes_controller.rb

  def index
    @prototypes = Prototype.includes(:user)
---
SELECT `prototypes`.* FROM `prototypes`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2, 1)

  def show
    @comment = Comment.new
    @prototype = Prototype.find(params[:id])
    @comments = @prototype.comments.includes(:user)
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 5 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 5
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1